# Recommender Systems

In [1]:
import numpy as np
import pandas as pd

In [4]:
!ls -l

total 4448
-rw-rw-r--@ 1 sathisanvannadil  staff    49292 Aug 31  2018 Movie_Id_Titles
-rw-r--r--  1 sathisanvannadil  staff     1157 May 13 13:20 iPrep_D08_0512.ipynb
-rw-rw-r--@ 1 sathisanvannadil  staff  1979226 Aug 31  2018 u.data
-rw-rw-r--@ 1 sathisanvannadil  staff   236344 Aug 31  2018 u.item

In [7]:
movie_titles = pd.read_csv('Movie_Id_Titles')
movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [9]:
u_data = pd.read_csv('u.data')
u_data.head()

      0\t50\t5\t881250949
0    0\t172\t5\t881250949
1    0\t133\t1\t881250949
2  196\t242\t3\t881250949
3  186\t302\t3\t891717742
4   22\t377\t1\t878887116

In [13]:
# u_item = pd.read_csv('u.item', sep="|")
# u_item.head()

In [14]:
column_names = ['user_id', 'item_id', 'rating', 'timestamp']
user_data = pd.read_csv('u.data', sep='\t', names= column_names)
user_data.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

- Merge user_data and movie_titles

In [16]:
movie_data = pd.merge(user_data,movie_titles, on='item_id' )
movie_data.head()

   user_id  item_id  rating  timestamp             title
0        0       50       5  881250949  Star Wars (1977)
1      290       50       5  880473582  Star Wars (1977)
2       79       50       4  891271545  Star Wars (1977)
3        2       50       5  888552084  Star Wars (1977)
4        8       50       5  879362124  Star Wars (1977)

- Average Rating

In [18]:
movie_data.groupby('title')['rating'].mean().sort_values(ascending=False).head()

title
Marlene Dietrich: Shadow and Light (1996)     5.0
Prefontaine (1997)                            5.0
Santa with Muscles (1996)                     5.0
Star Kid (1997)                               5.0
Someone Else's America (1995)                 5.0
Name: rating, dtype: float64

In [19]:
movie_data.groupby('title')['rating'].count().sort_values(ascending=False).head()

title
Star Wars (1977)             584
Contact (1997)               509
Fargo (1996)                 508
Return of the Jedi (1983)    507
Liar Liar (1997)             485
Name: rating, dtype: int64